region = {
    30: "Астраханская_область",
    34: "Волгоградская_область",
    63: "Самарская_область",
    }

cities={
    "Астраханская_область": "Астрахань",
    "Волгоградская_область": "Волгоград",
    "Самарская_область": "Самара",
    }

print("30 региону соответсвует", region[30])
print("34 региону соответсвует", region[34])
print("="*10)
print("Столица 30 региона",cities[region[30]])
print("Столица 34 региона",cities[region[34]])

for reg, ab in list(region.items()):
    print(f"{reg} соответсвует {ab}")

for reg, ab in list(region.items()):
    print(f"Столица региона №{reg} - {cities[ab]}")
